FirstRoutes/app/controllers/artworks_controller.rb

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "SubwayEatFresh"], ["image_url", "artttts.com"], ["artist_id", 4], ["created_at", "2019-01-29 01:28:39.431363"], ["updated_at", "2019-01-29 01:28:39.431363"]]
---
  def create
    artwork = Artwork.new(artwork_params)
    # artwork.save!

    if artwork.save