FirstRoutes/app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    # user.save!

    if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Granny"], ["email", "grannysmithapple@windows.live"], ["created_at", "2019-01-28 23:57:39.686313"], ["updated_at", "2019-01-28 23:57:39.686313"]]